import React, {FC} from 'react';
import SwiperReviews from "../../../components/containers/SwiperReviews/SwiperReviews";
import {IReview} from "../../../types";

const Reviews: FC = () => {
    const reviews: IReview[] = [
        {id: 1, user: 'Anton Antonov', text: 'Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію'},
        {id: 2, user: 'Anton Antonov', text: 'Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію'},
        {id: 3, user: 'Anton Antonov', text: 'Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію'},
        {id: 4, user: 'Anton Antonov', text: 'Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію'},
        {id: 5, user: 'Anton Antonov', text: 'Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію'},
        {id: 6, user: 'Anton Antonov', text: 'Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію'},
        {id: 7, user: 'Anton Antonov', text: 'Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію'},
        {id: 8, user: 'Anton Antonov', text: 'Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію'},
        {id: 9, user: 'Anton Antonov', text: 'Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію Розкажіть про свої задачі, ми зробимо гарну пропозиціюРозкажіть про свої задачі, ми зробимо гарну пропозицію'},
    ];

    return (
        <section>
            <SwiperReviews reviews={reviews}/>
        </section>
    );
};

export default Reviews;